Model: "model_8"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 128, 128, 16 0                                            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 32)   32800       input_6[0][0]                    
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 32, 32)   0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 32, 32)   128         activation_10[0][0]              
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 64)   32832       batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 64)   0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 64)   256         activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 32)   18464       batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 32)   0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 32)   128         activation_12[0][0]              
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 8192)         0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 256)          2097408     flatten_2[0][0]                  
__________________________________________________________________________________________________
input_5 (InputLayer)            [(None, 8)]          0                                            
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 256)          0           dense_15[0][0]                   
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 64)           576         input_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 256)          1024        activation_13[0][0]              
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 64)           4160        dense_12[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 256)          0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 64)           4160        dense_13[0][0]                   
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 256)          0           dropout_2[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 320)          0           dense_14[0][0]                   
                                                                 activation_14[0][0]              
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 1, 320)       0           concatenate_2[0][0]              
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 128)          229888      reshape_2[0][0]                  
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 128)          16512       lstm_1[0][0]                     
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 8)            1032        dense_16[0][0]                   
==================================================================================================
Total params: 2,439,368
Trainable params: 2,438,600
Non-trainable params: 768
__________________________________________________________________________________________________
