Model: "model_10"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            [(None, 128, 128, 4) 0                                            
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 64, 64, 32)   1184        input_7[0][0]                    
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 64, 64, 32)   0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 64, 64, 32)   128         activation_27[0][0]              
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 32, 32, 48)   13872       batch_normalization_24[0][0]     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 32, 32, 48)   0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 32, 32, 48)   192         activation_28[0][0]              
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 16, 16, 64)   27712       batch_normalization_25[0][0]     
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 16, 16, 64)   0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 16, 16, 64)   256         activation_29[0][0]              
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 8, 8, 128)    73856       batch_normalization_26[0][0]     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 8, 8, 128)    0           conv2d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 8, 8, 128)    512         activation_30[0][0]              
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 4, 4, 192)    221376      batch_normalization_27[0][0]     
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 4, 4, 192)    0           conv2d_25[0][0]                  
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 4, 4, 192)    768         activation_31[0][0]              
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 2, 2, 256)    442624      batch_normalization_28[0][0]     
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 2, 2, 256)    0           conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 2, 2, 256)    1024        activation_32[0][0]              
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 1, 1, 256)    262400      batch_normalization_29[0][0]     
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 1, 1, 256)    0           conv2d_27[0][0]                  
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 1, 1, 256)    1024        activation_33[0][0]              
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 256)          0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 256)          65792       flatten_4[0][0]                  
__________________________________________________________________________________________________
input_6 (InputLayer)            [(None, 8)]          0                                            
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 256)          0           dense_18[0][0]                   
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 64)           576         input_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 256)          1024        activation_34[0][0]              
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 64)           4160        dense_15[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 256)          0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 64)           4160        dense_16[0][0]                   
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 256)          0           dropout_3[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 320)          0           dense_17[0][0]                   
                                                                 activation_35[0][0]              
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 1, 320)       0           concatenate_2[0][0]              
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 1, 128)       41088       reshape_3[0][0]                  
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 1, 128)       16512       dense_19[0][0]                   
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1, 8)         1032        dense_20[0][0]                   
==================================================================================================
Total params: 1,181,272
Trainable params: 1,178,808
Non-trainable params: 2,464
__________________________________________________________________________________________________
