Model: "model_8"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 128, 128, 16 0                                            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 64, 32)   4640        input_6[0][0]                    
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 64, 64, 32)   0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 64, 64, 32)   128         activation_18[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 32, 32, 48)   13872       batch_normalization_16[0][0]     
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 32, 32, 48)   0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 32, 32, 48)   192         activation_19[0][0]              
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 16, 16, 64)   27712       batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 16, 16, 64)   0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 16, 16, 64)   256         activation_20[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 8, 8, 128)    73856       batch_normalization_18[0][0]     
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 8, 8, 128)    0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8, 8, 128)    512         activation_21[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 4, 4, 192)    221376      batch_normalization_19[0][0]     
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 4, 4, 192)    0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 4, 4, 192)    768         activation_22[0][0]              
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 2, 2, 256)    442624      batch_normalization_20[0][0]     
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 2, 2, 256)    0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 2, 2, 256)    1024        activation_23[0][0]              
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 1, 1, 256)    262400      batch_normalization_21[0][0]     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 1, 1, 256)    0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 1, 1, 256)    1024        activation_24[0][0]              
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 256)          0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 256)          65792       flatten_2[0][0]                  
__________________________________________________________________________________________________
input_5 (InputLayer)            [(None, 8)]          0                                            
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 256)          0           dense_15[0][0]                   
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 64)           576         input_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 256)          1024        activation_25[0][0]              
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 64)           4160        dense_12[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 256)          0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 64)           4160        dense_13[0][0]                   
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 256)          0           dropout_2[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 320)          0           dense_14[0][0]                   
                                                                 activation_26[0][0]              
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 1, 320)       0           concatenate_2[0][0]              
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 128)          229888      reshape_2[0][0]                  
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 128)          16512       lstm_1[0][0]                     
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 8)            1032        dense_16[0][0]                   
==================================================================================================
Total params: 1,373,528
Trainable params: 1,371,064
Non-trainable params: 2,464
__________________________________________________________________________________________________
