Model: "model_5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 128, 128, 16 0                                            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 32)   4640        input_4[0][0]                    
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64, 64, 32)   0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 32)   128         activation_9[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 48)   13872       batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 32, 48)   0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 32, 48)   192         activation_10[0][0]              
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 64)   27712       batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 64)   0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 64)   256         activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 8, 8, 128)    73856       batch_normalization_10[0][0]     
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 8, 8, 128)    0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 8, 8, 128)    512         activation_12[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 4, 4, 192)    221376      batch_normalization_11[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 4, 4, 192)    0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 4, 4, 192)    768         activation_13[0][0]              
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 2, 2, 256)    442624      batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 2, 2, 256)    0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 2, 2, 256)    1024        activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 1, 1, 256)    262400      batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 1, 1, 256)    0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 1, 1, 256)    1024        activation_15[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 256)          0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 256)          65792       flatten_1[0][0]                  
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 8)]          0                                            
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 256)          0           dense_9[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           576         input_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 256)          1024        activation_16[0][0]              
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           4160        dense_6[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 64)           4160        dense_7[0][0]                    
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 256)          0           dropout_1[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 320)          0           dense_8[0][0]                    
                                                                 activation_17[0][0]              
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 320)       0           concatenate_1[0][0]              
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 128)          229888      reshape_1[0][0]                  
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 128)          16512       lstm_1[0][0]                     
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 8)            1032        dense_10[0][0]                   
==================================================================================================
Total params: 1,373,528
Trainable params: 1,371,064
Non-trainable params: 2,464
__________________________________________________________________________________________________
