Model: "model_10"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            [(None, 128, 128, 4) 0                                            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 32)   8224        input_7[0][0]                    
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 32, 32, 32)   0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 32, 32, 32)   128         activation_15[0][0]              
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 64)   32832       batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 16, 16, 64)   0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 64)   256         activation_16[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 32)   18464       batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 16, 16, 32)   0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 16, 16, 32)   128         activation_17[0][0]              
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 8192)         0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 256)          2097408     flatten_4[0][0]                  
__________________________________________________________________________________________________
input_6 (InputLayer)            [(None, 8)]          0                                            
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 256)          0           dense_18[0][0]                   
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 64)           576         input_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 256)          1024        activation_18[0][0]              
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 64)           4160        dense_15[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 256)          0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 64)           4160        dense_16[0][0]                   
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 256)          0           dropout_3[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 320)          0           dense_17[0][0]                   
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 1, 320)       0           concatenate_2[0][0]              
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 1, 128)       41088       reshape_3[0][0]                  
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 1, 128)       16512       dense_19[0][0]                   
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1, 8)         1032        dense_20[0][0]                   
==================================================================================================
Total params: 2,225,992
Trainable params: 2,225,224
Non-trainable params: 768
__________________________________________________________________________________________________
