Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 4) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 32, 32, 32)   8224        input_2[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 32, 32, 32)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 32, 32, 32)   128         activation[0][0]                 
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 16, 16, 64)   32832       batch_normalization[0][0]        
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 16, 16, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 16, 16, 64)   256         activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 16, 32)   18464       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 16, 16, 32)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 16, 16, 32)   128         activation_2[0][0]               
__________________________________________________________________________________________________
flatten (Flatten)               (None, 8192)         0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 256)          2097408     flatten[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 8)]          0                                            
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256)          0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           576         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 256)          1024        activation_3[0][0]               
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           4160        dense[0][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 256)          0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           4160        dense_1[0][0]                    
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 256)          0           dropout[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 320)          0           dense_2[0][0]                    
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 320)       0           concatenate[0][0]                
__________________________________________________________________________________________________
lstm (LSTM)                     (None, 128)          229888      reshape[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 128)          16512       lstm[0][0]                       
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 8)            1032        dense_4[0][0]                    
==================================================================================================
Total params: 2,414,792
Trainable params: 2,414,024
Non-trainable params: 768
__________________________________________________________________________________________________
