Model: "model_5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 128, 128, 16 0                                            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 32)   32800       input_4[0][0]                    
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 32)   0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 32)   128         activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 16, 64)   32832       batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 16, 16, 64)   0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 64)   256         activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 16, 32)   18464       batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 16, 16, 32)   0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16, 16, 32)   128         activation_7[0][0]               
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 8192)         0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 256)          2097408     flatten_1[0][0]                  
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 8)]          0                                            
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 256)          0           dense_9[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           576         input_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 256)          1024        activation_8[0][0]               
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           4160        dense_6[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 64)           4160        dense_7[0][0]                    
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 256)          0           dropout_1[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 320)          0           dense_8[0][0]                    
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 320)       0           concatenate_1[0][0]              
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 128)          229888      reshape_1[0][0]                  
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 128)          16512       lstm_1[0][0]                     
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 8)            1032        dense_10[0][0]                   
==================================================================================================
Total params: 2,439,368
Trainable params: 2,438,600
Non-trainable params: 768
__________________________________________________________________________________________________
