Model: "model_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 128, 128, 4)]     0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 64, 64, 32)        1184      
_________________________________________________________________
activation_18 (Activation)   (None, 64, 64, 32)        0         
_________________________________________________________________
batch_normalization_16 (Batc (None, 64, 64, 32)        128       
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 32, 32, 48)        13872     
_________________________________________________________________
activation_19 (Activation)   (None, 32, 32, 48)        0         
_________________________________________________________________
batch_normalization_17 (Batc (None, 32, 32, 48)        192       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 16, 16, 64)        27712     
_________________________________________________________________
activation_20 (Activation)   (None, 16, 16, 64)        0         
_________________________________________________________________
batch_normalization_18 (Batc (None, 16, 16, 64)        256       
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_21 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
batch_normalization_19 (Batc (None, 8, 8, 128)         512       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 4, 4, 192)         221376    
_________________________________________________________________
activation_22 (Activation)   (None, 4, 4, 192)         0         
_________________________________________________________________
batch_normalization_20 (Batc (None, 4, 4, 192)         768       
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 2, 2, 256)         442624    
_________________________________________________________________
activation_23 (Activation)   (None, 2, 2, 256)         0         
_________________________________________________________________
batch_normalization_21 (Batc (None, 2, 2, 256)         1024      
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 1, 1, 256)         262400    
_________________________________________________________________
activation_24 (Activation)   (None, 1, 1, 256)         0         
_________________________________________________________________
batch_normalization_22 (Batc (None, 1, 1, 256)         1024      
_________________________________________________________________
flatten_2 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               65792     
_________________________________________________________________
activation_25 (Activation)   (None, 256)               0         
_________________________________________________________________
batch_normalization_23 (Batc (None, 256)               1024      
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
activation_26 (Activation)   (None, 256)               0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 256)               0         
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 256)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 128)               197120    
_________________________________________________________________
dense_13 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_14 (Dense)             (None, 8)                 1032      
=================================================================
Total params: 1,328,408
Trainable params: 1,325,944
Non-trainable params: 2,464
_________________________________________________________________
