Model: "model_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 128, 128, 4)]     0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 32, 32, 32)        8224      
_________________________________________________________________
activation_10 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 32, 32, 32)        128       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 16, 16, 64)        32832     
_________________________________________________________________
activation_11 (Activation)   (None, 16, 16, 64)        0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 16, 16, 64)        256       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 16, 16, 32)        18464     
_________________________________________________________________
activation_12 (Activation)   (None, 16, 16, 32)        0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 16, 16, 32)        128       
_________________________________________________________________
flatten_2 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               2097408   
_________________________________________________________________
activation_13 (Activation)   (None, 256)               0         
_________________________________________________________________
batch_normalization_11 (Batc (None, 256)               1024      
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
activation_14 (Activation)   (None, 256)               0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 256)               0         
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 256)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 128)               197120    
_________________________________________________________________
dense_13 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_14 (Dense)             (None, 8)                 1032      
=================================================================
Total params: 2,373,128
Trainable params: 2,372,360
Non-trainable params: 768
_________________________________________________________________
